In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("Bengaluru_House_Data.csv")
data

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00

In [3]:
len(list(data.location.unique()))  # unique areas

1306

In [4]:
for column in data.columns:
    print(data[column].value_counts())
    print("*"*70)

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64
**********************************************************************
Ready To Move    10581
18-Dec             307
18-May             295
18-Apr             271
18-Aug             200
                 ...
15-Dec               1
15-Jun               1
16-Jul               1
14-Nov               1
16-Jan               1
Name: availability, Length: 81, dtype: int64
**********************************************************************
Whitefield                  540
Sarjapur  Road              399
Electronic City             302
Kanakpura Road              273
Thanisandra                 234
                           ...
Sadhguru Layout               1
Doctor Layout Rayasandra      1
Milk Colony                   1
Laxminarayana Layout          1
 ittamadu                     1
Name: location, Length: 1305, dtype: int64
**********************************************************************
2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
11 BHK           2
10 BHK           2
43 Bedroom       1
19 BHK           1
27 BHK           1
13 BHK           1
12 Bedroom       1
18 Bedroom       1
16 BHK           1
14 BHK           1
Name: size, dtype: int64
**********************************************************************
GrrvaGr    80
PrarePa    76
Prtates    59
Sryalan    59
GMown E    56
           ..
Pantym      1
Un 46th     1
Bhath N     1
Vitat H     1
ARineun     1
Name: society, Length: 2688, dtype: int64
**********************************************************************
1200          843
1100          221
1500          205
2400          196
600           180
             ...
1413            1
2383            1
980 - 1030      1
3467.86         1
1452.55         1
Name: total_sqft, Length: 2117, dtype: int64
**********************************************************************
2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64
**********************************************************************
2.0    5113
1.0    4897
3.0    1672
0.0    1029
Name: balcony, dtype: int64
**********************************************************************
75.00    310
65.00    302
55.00    275
60.00    270
45.00    240
        ...
81.55      1
69.49      1
42.18      1
70.25      1
74.82      1
Name: price, Length: 1994, dtype: int64
**********************************************************************

In [5]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [6]:
houses = data.drop(columns = ['area_type', 'availability', 'society', 'balcony'])

In [7]:
houses.isna().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [8]:
houses.describe()

               bath         price
count  13247.000000  13320.000000
mean       2.692610    112.565627
std        1.341458    148.971674
min        1.000000      8.000000
25%        2.000000     50.000000
50%        2.000000     72.000000
75%        3.000000    120.000000
max       40.000000   3600.000000

In [9]:
houses.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [10]:
houses.isna().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [11]:
houses.location.value_counts()

Whitefield                  540
Sarjapur  Road              399
Electronic City             302
Kanakpura Road              273
Thanisandra                 234
                           ...
Sadhguru Layout               1
Doctor Layout Rayasandra      1
Milk Colony                   1
Laxminarayana Layout          1
 ittamadu                     1
Name: location, Length: 1305, dtype: int64

In [12]:
houses['location'] = houses['location'].fillna("Sarjapur  Road")

In [13]:
houses['size'].value_counts()

2 BHK         5199
3 BHK         4310
4 Bedroom      826
4 BHK          591
3 Bedroom      547
1 BHK          538
2 Bedroom      329
5 Bedroom      297
6 Bedroom      191
1 Bedroom      105
8 Bedroom       84
7 Bedroom       83
5 BHK           59
9 Bedroom       46
6 BHK           30
7 BHK           17
1 RK            13
10 Bedroom      12
9 BHK            8
8 BHK            5
11 Bedroom       2
11 BHK           2
10 BHK           2
43 Bedroom       1
19 BHK           1
27 BHK           1
13 BHK           1
12 Bedroom       1
18 Bedroom       1
16 BHK           1
14 BHK           1
Name: size, dtype: int64

In [14]:
houses['size'] = houses['size'].fillna("2 BHK")

In [15]:
houses['bath'].value_counts()

2.0     6908
3.0     3286
4.0     1226
1.0      788
5.0      524
6.0      273
7.0      102
8.0       64
9.0       43
10.0      13
12.0       7
13.0       3
11.0       3
16.0       2
27.0       1
18.0       1
40.0       1
15.0       1
14.0       1
Name: bath, dtype: int64

In [16]:
houses['bath'] = houses['bath'].fillna(data['bath'].median())

In [17]:
houses['bhk'] = houses['size'].str.split().str.get(0).astype(int)

In [18]:
houses[houses.bhk > 20]

                       location        size total_sqft  bath  price  bhk
1718  2Electronic City Phase II      27 BHK       8000  27.0  230.0   27
4684                Munnekollal  43 Bedroom       2400  40.0  660.0   43

In [19]:
houses['total_sqft'].sample(20)

10385    1890
1342     1840
13026    1020
4633     1342
6980     1115
6394     1255
5906     1100
12401    1300
11078    1120
10105     525
3333     1223
9408      984
2685     1756
10370    2650
2576     1065
5870     1750
7674     1859
5846     1374
11199    1798
293      1349
Name: total_sqft, dtype: object

In [20]:
def convert_range(x):
    try:
        if " - " in x:
            num1, num2 = x.split(" - ")
            return round(np.mean([float(num1), float(num2)]))
        else:
            return round(float(x))
    except Exception as e:
        return None


convert_range("5666 - 5669")

5668

In [21]:
houses['total_sqft'] = houses['total_sqft'].astype(str)

In [22]:
houses['total_sqft'] = houses['total_sqft'].apply(convert_range)

In [23]:
houses.total_sqft.sample(20)

6896     1200.0
2518      800.0
3155     1200.0
6622     1553.0
12836    1196.0
8126     1200.0
6788     1240.0
6137     1165.0
7127     2990.0
1337     1132.0
3525     1200.0
10739    1059.0
11669    1246.0
5692     1020.0
9607     1160.0
8981     1225.0
3917     1200.0
6295     1200.0
6471     1225.0
11569    1350.0
Name: total_sqft, dtype: float64

In [24]:
houses

                       location       size  total_sqft  bath   price  bhk
0      Electronic City Phase II      2 BHK      1056.0   2.0   39.07    2
1              Chikka Tirupathi  4 Bedroom      2600.0   5.0  120.00    4
2                   Uttarahalli      3 BHK      1440.0   2.0   62.00    3
3            Lingadheeranahalli      3 BHK      1521.0   3.0   95.00    3
4                      Kothanur      2 BHK      1200.0   2.0   51.00    2
...                         ...        ...         ...   ...     ...  ...
13315                Whitefield  5 Bedroom      3453.0   4.0  231.00    5
13316             Richards Town      4 BHK      3600.0   5.0  400.00    4
13317     Raja Rajeshwari Nagar      2 BHK      1141.0   2.0   60.00    2
13318           Padmanabhanagar      4 BHK      4689.0   4.0  488.00    4
13319              Doddathoguru      1 BHK       550.0   1.0   17.00    1

[13320 rows x 6 columns]

In [25]:
houses['price_per_sqft'] = houses['price']*100000 / houses['total_sqft']

In [26]:
houses.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626111      2.688814    112.565627      2.802778    7.907505e+03
std     1238.405483      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [27]:
houses.location.value_counts()  # too many locations

Whitefield                  540
Sarjapur  Road              400
Electronic City             302
Kanakpura Road              273
Thanisandra                 234
                           ...
Sadhguru Layout               1
Doctor Layout Rayasandra      1
Milk Colony                   1
Laxminarayana Layout          1
 ittamadu                     1
Name: location, Length: 1305, dtype: int64

In [28]:
houses.location = houses['location'].apply(lambda x: x.strip())

In [29]:
location_counts = houses.location.value_counts()

In [30]:
location_count_less_than_10 = houses.location.value_counts()[location_counts <= 10]

In [31]:
houses.location = houses.location.apply(lambda x: "other" if x in location_count_less_than_10 else x)

In [32]:
houses

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,3699.810606
1,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,4615.384615
2,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,4305.555556
3,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,6245.890861
4,Kothanur,2 BHK,1200.0,2.0,51.00,2,4250.000000
...,...,...,...,...,...,...,...
13315,Whitefield,5 Bedroom,3453.0,4.0,231.00,5,6689.834926
13316,other,4 BHK,3600.0,5.0,400.00,4,11111.111111
13317,Raja Rajeshwari Nagar,2 BHK,1141.0,2.0,60.00,2,5258.545136
13318,Padmanabhanagar,4 BHK,4689.0,4.0,488.00,4,10407.336319
13319,Doddathoguru,1 BHK,550.0,1.0,17.00,1,3090.909091

In [33]:
houses.location.value_counts()

other                        2885
Whitefield                    541
Sarjapur  Road                400
Electronic City               304
Kanakpura Road                273
                             ...
Kodigehalli                    11
Marsur                         11
Pattandur Agrahara             11
HAL 2nd Stage                  11
2nd Phase Judicial Layout      11
Name: location, Length: 242, dtype: int64

In [34]:
houses.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  13274.000000  13320.000000  13320.000000  13320.000000    1.327400e+04
mean    1559.626111      2.688814    112.565627      2.802778    7.907505e+03
std     1238.405483      1.338754    148.971674      1.294496    1.064296e+05
min        1.000000      1.000000      8.000000      1.000000    2.678298e+02
25%     1100.000000      2.000000     50.000000      2.000000    4.266865e+03
50%     1276.000000      2.000000     72.000000      3.000000    5.434306e+03
75%     1680.000000      3.000000    120.000000      3.000000    7.311746e+03
max    52272.000000     40.000000   3600.000000     43.000000    1.200000e+07

In [35]:
(houses['total_sqft']/houses["bhk"]).describe()

count    13274.000000
mean       575.074447
std        388.205025
min          0.250000
25%        473.333333
50%        552.500000
75%        625.000000
max      26136.000000
dtype: float64

In [36]:
houses = houses[((houses['total_sqft']/houses['bhk']) >= 300)]

In [37]:
houses.describe()

         total_sqft          bath         price           bhk  price_per_sqft
count  12530.000000  12530.000000  12530.000000  12530.000000    12530.000000
mean    1594.563927      2.559537    111.382401      2.650838     6303.983165
std     1261.271547      1.077938    152.077329      0.976678     4162.238590
min      300.000000      1.000000      8.440000      1.000000      267.829813
25%     1116.000000      2.000000     49.000000      2.000000     4210.526316
50%     1300.000000      2.000000     70.000000      3.000000     5294.117647
75%     1700.000000      3.000000    115.000000      3.000000     6916.666667
max    52272.000000     16.000000   3600.000000     16.000000   176470.588235

In [38]:
houses.shape

(12530, 7)

In [39]:
houses.price_per_sqft.describe()

count     12530.000000
mean       6303.983165
std        4162.238590
min         267.829813
25%        4210.526316
50%        5294.117647
75%        6916.666667
max      176470.588235
Name: price_per_sqft, dtype: float64

In [40]:
def remove_outliers_sqft(df):
    output_df = pd.DataFrame()
    for key, subdf in df.groupby("location"):
        mean = np.mean(subdf.price_per_sqft)
        std = np.std(subdf.price_per_sqft)
        gen_df = subdf[(subdf.price_per_sqft > (mean - std)) & (subdf.price_per_sqft <= (mean + std))]
        output_df = pd.concat([output_df, gen_df], ignore_index = True)
    return output_df

In [41]:
houses = remove_outliers_sqft(houses)

In [42]:
houses.price_per_sqft.describe()

count    10301.000000
mean      5659.066709
std       2265.774210
min       1250.000000
25%       4244.897959
50%       5175.600739
75%       6428.571429
max      24509.803922
Name: price_per_sqft, dtype: float64

In [43]:
def bhk_outlier_remover(df):
    exclude_indices = np.array([])
    for location, location_df in df.groupby("location"):
        bhk_stats = {}
        for bhk, bhk_df in location_df.groupby('bhk'):
            bhk_stats['bhk'] = {
                'mean': np.mean(bhk_df.price_per_sqft),
                'std': np.std(bhk_df.price_per_sqft),
                'count': bhk_df.shape[0]
            }
        for bhk, bhk_df in location_df.groupby('bhk'):
            stats = bhk_stats.get(bhk-1)
            if stats and stats['count'] > 5:
                exclude_indices = np.append(exclude_indices, bhk_df[bhk_df.price_per_sqft < (stats['mean'])].index.values)
    return df.drop(exclude_indices, axis = 'index')

In [44]:
houses = bhk_outlier_remover(houses)

In [45]:
houses.shape

(10301, 7)

In [46]:
houses

,location,size,total_sqft,bath,price,bhk,price_per_sqft
0,1st Block Jayanagar,4 BHK,2850.0,4.0,428.00,4,15017.543860
1,1st Block Jayanagar,3 BHK,1630.0,3.0,194.00,3,11901.840491
2,1st Block Jayanagar,3 BHK,1875.0,2.0,235.00,3,12533.333333
3,1st Block Jayanagar,3 BHK,1200.0,2.0,130.00,3,10833.333333
4,1st Block Jayanagar,2 BHK,1235.0,2.0,148.00,2,11983.805668
...,...,...,...,...,...,...,...
10296,other,2 BHK,1353.0,2.0,110.00,2,8130.081301
10297,other,1 Bedroom,812.0,1.0,26.00,1,3201.970443
10298,other,3 BHK,1440.0,2.0,63.93,3,4439.583333
10299,other,2 BHK,1075.0,2.0,48.00,2,4465.116279
10300,other,4 BHK,3600.0,5.0,400.00,4,11111.111111

In [47]:
clean_houses = houses.drop(columns = ['size', 'price_per_sqft'])

In [48]:
clean_houses

                  location  total_sqft  bath   price  bhk
0      1st Block Jayanagar      2850.0   4.0  428.00    4
1      1st Block Jayanagar      1630.0   3.0  194.00    3
2      1st Block Jayanagar      1875.0   2.0  235.00    3
3      1st Block Jayanagar      1200.0   2.0  130.00    3
4      1st Block Jayanagar      1235.0   2.0  148.00    2
...                    ...         ...   ...     ...  ...
10296                other      1353.0   2.0  110.00    2
10297                other       812.0   1.0   26.00    1
10298                other      1440.0   2.0   63.93    3
10299                other      1075.0   2.0   48.00    2
10300                other      3600.0   5.0  400.00    4

[10301 rows x 5 columns]

In [49]:
clean_houses.to_csv("Clean_Houses_Data.csv")

### EDA completed

# Model Training Starts

In [50]:
df = pd.read_csv("Clean_Houses_Data.csv")
df.drop(columns = ['Unnamed: 0'], inplace = True)
df

                  location  total_sqft  bath   price  bhk
0      1st Block Jayanagar      2850.0   4.0  428.00    4
1      1st Block Jayanagar      1630.0   3.0  194.00    3
2      1st Block Jayanagar      1875.0   2.0  235.00    3
3      1st Block Jayanagar      1200.0   2.0  130.00    3
4      1st Block Jayanagar      1235.0   2.0  148.00    2
...                    ...         ...   ...     ...  ...
10296                other      1353.0   2.0  110.00    2
10297                other       812.0   1.0   26.00    1
10298                other      1440.0   2.0   63.93    3
10299                other      1075.0   2.0   48.00    2
10300                other      3600.0   5.0  400.00    4

[10301 rows x 5 columns]

In [51]:
X = df.drop(columns = ['price'])
y = df['price']

In [52]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression, Lasso, Ridge
from sklearn.preprocessing import OneHotEncoder, StandardScaler
from sklearn.compose import make_column_transformer
from sklearn.pipeline import make_pipeline
from sklearn.metrics import r2_score

In [53]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [54]:
print(X_train.shape)
print(X_test.shape)

(8240, 4)
(2061, 4)

## Applying LR

In [55]:
column_trans = make_column_transformer((OneHotEncoder(sparse = False), ['location']), remainder = 'passthrough')

In [56]:
scaler = StandardScaler()

In [57]:
lin_reg = LinearRegression()

In [58]:
lr_pipeline = make_pipeline(column_trans, scaler, lin_reg)

In [59]:
lr_pipeline.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()),
                ('linearregression', LinearRegression())])

In [60]:
y_pred_lr = lr_pipeline.predict(X_test)

In [61]:
lr_score = r2_score(y_test, y_pred_lr)

## Applying Lasso

In [62]:
lasso = Lasso()

In [63]:
pipeline = make_pipeline(column_trans, scaler, lasso)

In [64]:
pipeline.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('lasso', Lasso())])

In [65]:
y_pred_lasso = pipeline.predict(X_test)
lasso_score = r2_score(y_test, y_pred_lasso)

## Applying Ridge

In [66]:
ridge = Ridge()

In [67]:
pipeline = make_pipeline(column_trans, scaler, ridge)

In [68]:
pipeline.fit(X_train, y_train)

Pipeline(steps=[('columntransformer',
                 ColumnTransformer(remainder='passthrough',
                                   transformers=[('onehotencoder',
                                                  OneHotEncoder(sparse=False),
                                                  ['location'])])),
                ('standardscaler', StandardScaler()), ('ridge', Ridge())])

In [69]:
y_pred_ridge = pipeline.predict(X_test)
ridge_score = r2_score(y_test, y_pred_lasso)

In [70]:
print(f"No Regularization: {lr_score}")
print(f"Lasso Regularization: {lasso_score}")
print(f"Ridge Regularization: {ridge_score}")

No Regularization: 0.8298888250754234
Lasso Regularization: 0.8225978829565423
Ridge Regularization: 0.8225978829565423

In [71]:
import pickle

In [73]:
pickle.dump(lr_pipeline, open("LR_model.pkl", "wb"))